Revit 2027 API
DirectShapeTypeOptions.IsEqualTo Method
 Compare this object with the one supplied as argument. Return true if the options specified by both objects are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqualTo(
	DirectShapeTypeOptions other
)
Public Function IsEqualTo (
	other As DirectShapeTypeOptions
) As Boolean
public:
bool IsEqualTo(
	DirectShapeTypeOptions^ other
)
member IsEqualTo :
        other : DirectShapeTypeOptions -> bool
Parameters
other DirectShapeTypeOptions
 the DirectShapeTypeOptions object to be compared.
Return Value
Boolean
 True if both objects specify the same options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace